Revit 2024 API
MassLevelData.IsEmpty Method
 Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not if the level does not intersect the mass geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsEmpty()
Visual Basic
Public Function IsEmpty As Boolean
Visual C++
public:
bool IsEmpty()
Return Value
 Returns True if MassLevelData is dimensionless, False otherwise.
See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace